Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: བྱིས་པ་ལ་ཡང་རྒ་བ་མེད་དེ། དེའི་ཕྱིར་བྱིས་པ་ནི་རྒ་བར་མི་འགྱུར་རོ། །
en: There would be no aging for a child, and thus a child would never age.

source: རྒ་བ་མེད་ན་ཇི་ལྟར་ན་རྒ་བར་འགྱུར།
en: If there were no old age, how would one become old?

source: དེ་ལྟར་མ་རྒས་པ་ནི་རྒ་བར་མི་འགྱུར་རོ། །
en: In such circumstances one who is not old would never age.

source: གལ་ཏེ་རྒས་པ་རྒ་བར་འགྱུར་ན་རྒ་བ་གཞོན་ནུར་ཡང་ཇི་སྟེ་མི་འགྱུར།
en: If an old person aged, then why would a young person not age?

source: དེའི་ཕྱིར་རྒ་བ་སྟོན་པ་ཡང་ཐ་སྙད་དུ་སྟོན་པའོ། །
en: Therefore, the teaching on aging is a conventional teaching.

source: དེ་ལ་ཇི་ལྟར་ན་འཆི་བ་སྟོན་པ་ཐ་སྙད་དུ་སྟོན་པ་ཡིན་ཞེ་ན།
en: “How is the teaching on death a conventional teaching?

source: འཆི་བ་ནི་དོན་དམ་པར་ཡོད་པ་མ་ཡིན་ནོ། །
en: Death does not ultimately exist.

source: གལ་ཏེ་འཆི་བ་དོན་དམ་པར་ཡོད་དུ་ཟིན་ན་ནི་གཟུང་བར་འགྱུར་ཏེ།
en: If death were to exist ultimately, it would be something acquired.

source: གཅིག་གིས་བཟུང་བས་སྲོག་ཆགས་གཞན་ཐམས་ཅད་མི་འཆི་བར་འགྱུར་བའི་རིགས་ན། མི་འཆི་བར་ཡང་མི་འགྱུར་ཏེ།
en: It would then be logical that if a single living being acquired it, then all other living beings would not die; however, there is no one who does not die.

source: འཆི་བ་ནི་ག་ལས་ཀྱང་མི་འོང་། གང་དུ་ཡང་མི་འགྲོ་བས་འཆི་བ་ནི་སྟོན་པ་སྟེ། དེའི་ཕྱིར་འཆི་བ་སྟོན་པ་ཐ་སྙད་དུ་སྟོན་པའོ། །
en: Since it is taught that death does not come from anywhere or go anywhere, the teaching on death is a conventional teaching.

source: དེ་ལ་ཇི་ལྟར་ན་ཤི་བའི་ཉིང་མཚམས་སྦྱོར་བ་སྟོན་པ་ཐ་སྙད་དུ་སྟོན་པ་ཡིན་ཞེ་ན།
en: “How is the teaching on transmigration upon death a conventional teaching?

source: ཤི་བའི་ཉིང་མཚམས་སྦྱོར་བ་ནི་དོན་དམ་པར་ཡོད་པ་མ་ཡིན་ནོ། །
en: Transmigration upon death does not ultimately exist.

source: གལ་ཏེ་ཤི་བའི་ཉིང་མཚམས་སྦྱོར་བ་དོན་དམ་པར་ཡོད་དུ་ཟིན་ན་ནི་གང་འཆི་བ་དེ་ཉིད་སྐྱེ་བར་འགྱུར་རོ། །དེ་ལྟར་ཤི་བ་ཉིད་སྐྱེ་བར་འགྱུར་ན་ནི་གང་ཉིང་མཚམས་སྦྱོར་བ་དང་། གང་དུ་ཉིང་མཚམས་སྦྱོར་བའི་ལུས་གཉིས་སུ་འགྱུར་རོ། །
en: If transmigration upon death were to exist ultimately, the very same being who died would be the being who is born, entailing that the one who died would have two bodies upon birth: the body that transmigrated and the body in which they transmigrate.

source: གལ་ཏེ་ཉིང་མཚམས་སྦྱོར་བ་ཞིག་ཡོད་དུ་ཟིན་ན་ནི་ཕུང་པོ་ལྔ་རྣམས་ཀྱང་ཡོད་པར་འགྱུར་རོ། །
en: If transmigration were to exist, the five aggregates would also exist.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why?

source: ཕུང་པོ་ལས་རྣམ་པར་གྲོལ་བའི་རྣམ་པར་ཤེས་པ་འཇུག་པ་མེད་དེ།
en: Because the consciousness that was freed from the aggregates would not have a point of access.

source: གཟུགས་ལ་ཉེ་བར་འགྲོ་ཞིང་རྣམ་པར་ཤེས་པ་འཇུག་གོ། །རྣམ་པར་ཤེས་པ་ནི་ཚོར་བ་ལ་ཉེ་བར་འགྲོ། འདུ་ཤེས་ལ་ཉེ་བར་འགྲོ།
en: It is consciousness that approaches and enters form, and consciousness that approaches sensation, approaches perception, and approaches formations.

source: འདུ་བྱེད་ལ་ཉེ་བར་འགྲོ་ཞིང་དེ་ལ་རྟེན། དེ་ལ་དམིགས་ཏེ་རྣམ་པར་ཤེས་པ་འཇུག་གོ། །
en: It is consciousness that depends on them, observes them, and enters them.

source: མི་རྟེན་པའི་རྣམ་པར་ཤེས་པ་ནི་སྐད་ཅིག་ཙམ་ཡང་འཇུག་པ་མེད་དོ། །
en: An unsupported consciousness would not enter for even a moment.

source: ཇི་ལྟར་ཆོས་གནས་པ་བཞིན་དུ་ས་བོན་དང་མྱུ་གུ་ལྟར་འབྱུང་བས་དེའི་ཕྱིར་ཤི་བའི་ཉིང་མཚམས་སྦྱོར་བ་སྟོན་པ་ནི་ཐ་སྙད་དུ་སྟོན་པའོ། །
en: Because transmigration upon death occurs in the same way as any persisting phenomenon arises—like a seed and a sprout—it is a conventional teaching.

source: དེ་ལ་ཇི་ལྟར་ན་དེ་ཞི་བར་འགྱུར་བའི་མྱ་ངན་ལས་འདས་པ་སྟོན་པ་ཐ་སྙད་དུ་སྟོན་པ་ཡིན་ཞེ་ན།
en: “How is the teaching on the peace of nirvāṇa a conventional teaching?

source: མྱ་ངན་ལས་འདས་པ་ནི་དོན་དམ་པར་ཡོད་པ་མ་ཡིན་ཏེ།
en: Nirvāṇa does not ultimately exist.

source: འཁོར་བ་ཉེ་བར་ཞི་བ་ནི་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ། །
en: The pacification of saṃsāra is called nirvāṇa.

source: འཁོར་བ་ཉིད་མྱ་ངན་ལས་འདས་པ་ཡང་མ་ཡིན་ལ། འཁོར་བ་ལས་མྱ་ངན་ལས་འདས་པ་ཐ་དད་དུ་གྱུར་པ་ཡང་མ་ཡིན་ཏེ།
en: Saṃsāra is not itself nirvāṇa, nor is nirvāṇa distinct from saṃsāra.

source: འཁོར་བ་དེ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུ་སྟེ། ཡོད་པས་ཀྱང་མ་ཡིན། མེད་པས་ཀྱང་མ་ཡིན། ཡོད་མེད་དུ་གྱུར་པས་ཀྱང་མི་འབྱུང་ངོ་། །ཇི་ལྟར་དེ་ཡོད་པས་ཀྱང་མ་ཡིན།
en: Saṃsāra, like a dream or an illusion, neither exists nor does not exist, nor does it arise because of being both existent and nonexistent.

source: མེད་པས་ཀྱང་མ་ཡིན། ཡོད་མེད་དུ་གྱུར་པས་ཀྱང་མི་འབྱུང་བ་དེ་བཞིན་དུ། ཡོད་པས་ཀྱང་མ་ཡིན། མེད་པས་ཀྱང་མ་ཡིན། ཡོད་མེད་དུ་གྱུར་པས་ཀྱང་མི་ལྡོག་སྟེ།
en: Just as saṃsāra does not exist or not exist and does not arise through being both existent and nonexistent, it does not cease because of not existing, not not existing, or being both existent and nonexistent.

source: གཞན་དུ་ན་འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་ནི་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ། །
en: Alternatively, the cessation of perception and sensation is called nirvāṇa.

source: འདུ་ཤེས་དེ་ནི་སྨིག་རྒྱུ་ལྟ་བུའོ། །ཚོར་བ་ནི་ཆུའི་ཆུ་བུར་ལྟ་བུའོ། །སྨིག་རྒྱུ་དང་།
en: Perception is just like a mirage; sensation is like a water bubble.

source: ཆུའི་ཆུ་བུར་གྱི་འབྱུང་བ་དང་ལྡོག་པ་ཇི་ལྟ་བར་འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པ་ཡང་དེ་བཞིན་ཏེ།
en: Just as a mirages and water bubbles arise and cease, so it is with saṃsāra and nirvāṇa.

source: དེའི་ཕྱིར་དེ་ཞི་བར་འགྱུར་བའི་མྱ་ངན་ལས་འདས་པ་སྟོན་པ་ནི་ཐ་སྙད་དུ་སྟོན་པ་ཡིན་ཏེ།
en: Therefore, the teaching on the peace of nirvāṇa is a conventional teaching.

source: བྱང་ཆུབ་སེམས་དཔས་བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཐ་སྙད་དུ་སྟོན་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: “Bodhisattvas should understand these ten as the conventional teachings of the thus-gone, worthy, completely perfect buddhas.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: “Child of good family, bodhisattvas should understand emptiness through ten approaches to the way of the Dharma.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བདག་མེད་པ་དང་།
en: What are these ten?

source: སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གང་ཟག་མེད་པ་དང་། རྗེ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་།
en: (1) The absence of self, (2) the absence of beings, (3) the absence of life, (4) the absence of a person, (5) the absence of a governing power, (6) the absence of birth, (7) the absence of cessation, (8) the absence of conditioning, (9) the absence of doing, and (10) the absence of ownership.

source: འགགས་པ་མེད་པ་དང་། མངོན་པར་འདུ་མི་བྱེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། བདག་པོ་མེད་པའོ། །དེ་ལ་ཇི་ལྟར་ན་བདག་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should emptiness be understood through the absence of self?

source: སྟོང་པ་ཉིད་ནི་དངོས་པོ་ཡང་མ་ཡིན། དངོས་པོ་མེད་པ་ཡང་མ་ཡིན་ནོ། །
en: Emptiness is neither something substantial nor insubstantial.

source: གལ་ཏེ་སྟོང་པ་ཉིད་དངོས་པོ་ཡིན་དུ་ཟིན་ན་ནི་སྟོང་པ་ཉིད་འདུས་བྱས་དང་མི་རྟག་པར་འགྱུར་རོ། །
en: If emptiness were substantial, it would be compounded and impermanent.

source: ཅི་སྟེ་སྟོང་པ་ཉིད་དངོས་པོ་མེད་པ་ཡིན་དུ་ཟིན་ན་ནི་སྟོང་པ་མི་སྟོང་པར་འགྱུར་ཏེ།
en: If emptiness were insubstantial, the empty would not be empty.

source: དེའི་ཕྱིར་སྟོང་པ་ཉིད་དངོས་པོ་ཡང་མ་ཡིན། དངོས་པོ་མེད་པ་ཡང་མ་ཡིན་ཏེ།
en: Therefore, emptiness is neither something substantial nor insubstantial.

source: དེ་ལྟར་བདག་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: Thus, emptiness should be understood through the absence of self.

source: ཇི་ལྟར་ན་སེམས་ཅན་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should emptiness be understood through the absence of beings?

source: སེམས་ཅན་ནི་སྟོང་པ་ཡང་མ་ཡིན། མི་སྟོང་པ་ཡང་མ་ཡིན་ནོ། །
en: Beings are neither empty nor not empty.

source: གལ་ཏེ་སེམས་ཅན་སྟོང་པ་ཡིན་ན་ནི་སྲོག་གཅོད་པ་བྱས་ཀྱང་སྡིག་པར་མི་འགྱུར་རོ། །
en: If beings were empty, then even killing would not be an evil act.

source: འོན་ཏེ་སྟོང་པ་མ་ཡིན་ན་ནི་རྟག་པར་འགྱུར་རོ། །
en: Yet if they were not empty, they would be permanent.

source: དེ་ལྟ་བས་ན་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་སེམས་ཅན་ནི་རྟག་པ་ཡང་མ་ཡིན། མི་རྟག་པ་ཡང་མ་ཡིན། འདུས་བྱས་ཀྱང་མ་ཡིན། འདུས་མ་བྱས་ཀྱང་མ་ཡིན་ཞེས་གསུངས་ཏེ།
en: This is why the Blessed One said, ‘Beings are neither permanent nor impermanent, neither compounded nor uncompounded.’

source: དེ་ལྟར་ན་སེམས་ཅན་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how emptiness should be understood through the absence of beings.

source: ཇི་ལྟར་ན་སྲོག་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should emptiness be understood through the absence of life?

source: སྟོང་པ་ཉིད་ནི་མི་འཚོ་མི་འཆིའོ། །
en: Emptiness neither lives nor dies.

source: དེ་ལ་མིག་ནི་བདག་དང་བདག་གིས་སྟོང་ངོ་། །
en: For example, the eye is empty of ‘I’ and ‘mine’.

source: གང་བདག་དང་བདག་གིས་སྟོང་པ་དེ་ནི་མི་འཚོ་མི་འཆིའོ། །
en: That which is empty of ‘I’ and ‘mine’ neither lives nor dies.

source: དེ་བཞིན་དུ་རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་། ཡིད་ནི་བདག་དང་བདག་གིས་སྟོང་ངོ་། །གང་བདག་དང་བདག་གིས་སྟོང་པ་དེ་ནི་མི་འཚོ་མི་འཆི་བ་སྟེ།
en: The ear, nose, tongue, body, and mind are similarly empty of ‘I’ and ‘mine,’ and that which is empty of ‘I’ and ‘mine’ neither lives nor dies.

source: དེ་ལྟར་ན་སྲོག་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how emptiness should be understood through the absence of life.

source: དེ་ལ་ཇི་ལྟར་ན་གང་ཟག་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should emptiness be understood through the absence of a person?

source: སྟོང་པ་ཉིད་ནི་གང་ཟག་ཏུ་བགྲང་བ་མ་ཡིན།
en: Emptiness is not considered a person.

source: སྟོང་པ་ཉིད་ནི་ཆོས་སུ་བགྲང་བ་མ་ཡིན་ནོ། །
en: Emptiness is not considered a phenomenon.

source: ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་རྣམས་ནི་སྟོང་པ་ཡིན་ཏེ།
en: The aggregates, elements, and sense bases are empty.

source: དེ་དག་བཟུང་ནས་གང་ཟག་ཅེས་བཏགས་སོ། །
en: They are conceptually fixated on, and then conceptually designated as ‘a person.’

source: གང་བཟུང་ནས་བཏགས་པ་དེ་ནི་ཡོད་པ་དང་མེད་པ་ཞེས་བརྗོད་པར་བྱ་བ་མ་ཡིན་ཏེ།
en: It should not be claimed that anything designated through conceptual fixation exists or does not exist.

source: དེ་ལྟར་གང་ཟག་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how emptiness should be understood through the absence of a person.

source: ཇི་ལྟར་ན་རྗེ་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should emptiness be understood through the absence of a governing power?

source: སྟོང་པ་ཉིད་ལས་རྣམ་པར་གྲོལ་བའི་ཆོས་གང་ཡང་མེད་པས་གང་སྟོང་པ་ཉིད་ཀྱི་རྗེར་འགྱུར་བའི་ཆོས་གང་ཡང་མེད་དེ།
en: Because there is nothing that is beyond emptiness, there is nothing to be a governing power of emptiness.

source: དེ་ལྟར་རྗེ་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how emptiness should be understood through the absence of a governing power.

source: དེ་ལ་ཇི་ལྟར་ན་སྐྱེ་བ་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should emptiness be understood through the absence of birth?

source: སྟོང་པ་ཉིད་ནི་མི་སྐྱེ་སྟེ།
en: Emptiness is not born.

source: གལ་ཏེ་སྟོང་པ་ཉིད་སྐྱེ་ན་ནི་སྟོང་པ་ཉིད་དུ་མི་འགྱུར་ཏེ།
en: If emptiness were born it would not be emptiness.

source: དེ་ལྟར་ན་སྟོང་པ་ནི་སྟོང་པ་མ་ཡིན་པར་འགྱུར་རོ། །
en: The empty would therefore not be empty.

source: གལ་ཏེ་སྐྱེས་པ་མི་སྟོང་སྟེ། སྟོང་པ་ཉིད་བདག་ཉིད་ཀྱིས་སྐྱེ་ན་ནི་མ་སྐྱེས་པ་དེ་མི་སྟོང་པར་མི་འགྱུར་ཏེ།
en: If something that has been born were not empty, and emptiness does not birth itself, then the unborn would not be nonempty.

source: དེ་ལྟར་སྐྱེ་བ་མེད་པས་སྟོང་པ་ཉིད་སྐྱེ་ན་ནི་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how emptiness should be understood through the absence of birth.

source: ཇི་ལྟར་འགག་པ་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should emptiness be understood through the absence of cessation?

source: གང་སྐྱེ་བ་དེ་ནི་འགག་སྟེ། སྟོང་པ་ཉིད་ནི་སྐྱེ་བ་མ་ཡིན་ནོ། །
en: Whatever is born ceases, and emptiness is not born.

source: གང་མི་སྐྱེ་བ་དེ་ཇི་ལྟར་འགག་པར་འགྱུར་ཏེ།
en: How could something that is not born cease?

source: དེ་ལྟར་འགག་པ་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how emptiness should be understood through the absence of cessation.

source: ཇི་ལྟར་མངོན་པར་འདུ་མི་བྱེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should emptiness be understood through the absence of conditioning?

source: སྟོང་པ་ཉིད་ནི་མི་བྱ་མི་བྱེད་དོ། །
en: Emptiness is not acted on, nor does it act.

source: དེ་དག་བཟུང་ནས་སྟོང་པ་ཉིད་དུ་འདོགས་སོ། །
en: When they are fixated on, they are conceptually designated as emptiness.

source: དེ་ལྟར་མངོན་པར་འདུ་མི་བྱེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how emptiness should be understood through the absence of conditioning.

source: ཇི་ལྟར་ན་བྱེད་པ་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should emptiness be understood through the absence of doing?

source: སྟོང་པ་ཉིད་ནི་གང་གིས་ཀྱང་འདི་ལྟ་འདི་ལྟ་བུར་གྱིས་ཤིག་ཅེས་བྱེད་དུ་གཞུག་པ་མ་ཡིན་ཏེ།
en: Emptiness cannot be effected by saying, ‘You should do it this way.’

source: དེ་ལྟར་བྱེད་པ་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how emptiness should be understood through the absence of doing.

source: ཇི་ལྟར་ན་བདག་པོ་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should emptiness be understood through the absence of ownership?

source: སྟོང་པ་ཉིད་ནི་ཡུལ་མ་ཡིན་ཞིང་ཡུལ་མེད་པས། སེམས་དང་ཡིད་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་དང་བྲལ་བ་སྟེ།
en: Emptiness is not an object and does not have an object; it is devoid of mind, thought, and the mind consciousness.

source: དེ་ལྟར་བདག་པོ་མེད་པས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how emptiness should be understood through the absence of ownership.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུ་པོ་དེ་དག་གིས་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: “Child of good family, bodhisattvas should understand emptiness through these ten approaches to the way of the Dharma.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུས་སྟོང་པ་ཉིད་ཀྱི་མི་འཐུན་པའི་ཕྱོགས་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: “Child of good family, bodhisattvas should understand the factors that oppose emptiness through ten approaches to the way of the Dharma.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མ་རིག་པ་མི་འཐུན་པའི་ཕྱོགས་དང་། སྲེད་པ་མི་འཐུན་པའི་ཕྱོགས་དང་།
en: What are these ten?

source: ལས་མི་འཐུན་པའི་ཕྱོགས་དང་། རྣམ་པར་ཤེས་པ་མི་འཐུན་པའི་ཕྱོགས་དང་། ལེན་པ་མི་འཐུན་པའི་ཕྱོགས་དང་། ལྟ་བ་མི་འཐུན་པའི་ཕྱོགས་དང་། ཐེ་ཚོམ་མི་འཐུན་པའི་ཕྱོགས་དང་།
en: The opposing factors of (1) ignorance, (2) craving, (3) karma, (4) consciousness, (5) grasping, (6) view, (7) doubt, (8) a sense of superiority, (9) pride, and (10) agitation.

source: མཆོག་ཏུ་འཛིན་པ་མི་འཐུན་པའི་ཕྱོགས་དང་། ང་རྒྱལ་མི་འཐུན་པའི་ཕྱོགས་དང་རྒོད་པ་མི་འཐུན་པའི་ཕྱོགས་ཏེ། རྣམ་པ་བཅུ་པོ་དེ་དག་ནི་སྟོང་པ་ཉིད་ཀྱི་མི་འཐུན་པའི་ཕྱོགས་སོ། །
en: These are the ten factors that oppose emptiness.

source: དེ་ལ་མ་རིག་པ་ནི་གཉིས་སུ་བགྲང་བ་དང་། རྣམ་པ་བཞིའོ། །
en: “There are two categories and four types of ignorance.

source: གཉིས་སུ་བགྲང་བ་གང་ཞེ་ན།
en: What are the two categories?

source: ཉོན་མོངས་པའི་སྒྲིབ་པར་བགྲང་བ་དང་། ཤེས་བྱའི་སྒྲིབ་པར་བགྲང་བའོ། །
en: The obscuration of the afflictive emotions and cognitive obscurations.

source: དེ་ལ་རྣམ་པ་བཞི་གང་ཞེ་ན།
en: What are the four types?

source: འདོད་པ་ལ་མངོན་པར་ཆགས་པའི་རྒྱུ་ལས་བྱུང་བ་དང་། གཟུགས་ལ་མངོན་པར་ཆགས་པའི་རྒྱུ་ལས་བྱུང་བ་དང་། གཟུགས་མེད་པ་ལ་མངོན་པར་ཆགས་པའི་རྒྱུ་ལས་བྱུང་བ་དང་། དངོས་པོ་མེད་པ་ལ་མངོན་པར་ཆགས་པའི་རྒྱུ་ལས་བྱུང་བའོ། །
en: Ignorance that arises out of attachment to the desire realm, ignorance that arises out of attachment to the form realm, ignorance that arises out of attachment to the formless realm, and ignorance that arises out of attachment to the insubstantial.

source: དེ་ལ་སྲེད་པ་ནི་གཞི་གཉིས་དང་། རྣམ་པ་བཞི་སྟེ།
en: “Craving has two bases and four types.

source: གཞི་གཉིས་གང་ཞེ་ན།
en: What are the two bases?

source: སྲིད་པའི་གཞི་དང་། ལོངས་སྤྱོད་ཀྱི་གཞིའོ། །
en: A basis in existence and a basis in enjoyment.

source: རྣམ་པ་བཞི་གང་ཞེ་ན།
en: What are the four aspects?

source: འདོད་པ་ལ་སྲེད་པ་དང་། གཟུགས་ལ་སྲེད་པ་དང་། གཟུགས་མེད་པ་ལ་སྲེད་པ་དང་། དངོས་པོ་མེད་པ་ལ་སྲེད་པའོ། །
en: Craving for the desire realm, craving for the form realm, craving for formless realms, and craving for the insubstantial.

source: དེ་ལ་ལས་ནི་ལྡང་བ་གཅིག་དང་། རྣམ་པ་གསུམ་དང་། རྣམ་པར་སྨིན་པ་གསུམ་སྟེ།
en: “Karma has one manifestation, three types, and three results.

source: དེ་ལ་ལྡང་བ་གཅིག་གང་ཞེ་ན།
en: What is the one manifestation?

source: ཡིད་ཀྱི་ལས་སོ། །
en: It is mental karma.

source: རྣམ་པ་གསུམ་གང་ཞེ་ན།
en: What are the three types?

source: ལུས་ལས་བྱུང་བ་དང་། ངག་ལས་བྱུང་བ་དང་། སེམས་ལས་བྱུང་བའོ། །
en: Karma that arises from body, from speech, and from mind.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་གསུམ་གང་ཞེ་ན། གནག་ལ་རྣམ་པར་སྨིན་པ་གནག་པ་དང་།
en: What then are the three results?

source: དཀར་ལ་རྣམ་པར་སྨིན་པ་དཀར་བ་དང་། དཀར་གནག་འདྲེན་མ་ལ་རྣམ་པར་སྨིན་པ་དཀར་གནག་འདྲེན་མའོ། །
en: Nonvirtuous results from nonvirtuous deeds, virtuous results from virtuous deeds, and a mixture of nonvirtuous and virtuous results from a mixture of nonvirtuous and virtuous deeds.

source: དེ་ལ་རྣམ་པར་ཤེས་པ་ནི་རྣམ་པ་དྲུག་སྟེ། མིག་གི་རྣམ་པར་ཤེས་པ་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའོ། །
en: “Consciousness has six aspects: the consciousnesses of the eye, ear, nose, tongue, body, and mind.

source: རྣམ་པ་དྲུག་པོ་དེ་དག་ནི་རྣམ་པར་ཤེས་པ་སྟེ། ཕྱིན་ཅི་ལོག་ལ་དམིགས་པ་དང་། ཕྱིན་ཅི་མ་ལོག་པ་ལ་དམིགས་པ་དང་། དམིགས་པ་མེད་པའོ། །
en: These six aspects are consciousness; they conceptually fixate on the mistaken, conceptually fixate on the unmistaken, and are without conceptual fixation.

source: དེ་ལ་ཕྱིན་ཅི་ལོག་ལ་དམིགས་པ་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམ་པར་གཡེངས་པ་སེམས་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་རྣམས་ཀྱི་འདོད་པ་དང་། གཟུགས་དང་གཟུགས་མེད་པའི་རྒྱུ་ལས་བྱུང་བའོ། །
en: Conceptual fixation on the mistaken refers to foolish ordinary people; it refers to the mistaken, distracted minds that arise from the desire, form, and formless realms as their cause.

source: ཕྱིན་ཅི་མ་ལོག་པ་ལ་དམིགས་པ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་མྱ་ངན་ལས་འདས་པའི་རྒྱུར་འགྱུར་བའོ། །
en: Conceptual fixation on the unmistaken is the cause of the nirvāṇa of śrāvakas and pratyekabuddhas.

source: དེ་གཉི་ག་ལས་རྣམ་པར་གྲོལ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དམིགས་པ་མེད་པ་སྟེ།
en: Liberation from both of these two is the bodhisattvas’ lack of conceptual fixation.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་རྒྱུར་འགྱུར་བའོ། །
en: It is the cause of the Dharma of the Buddha.

source: དེ་ལ་ལེན་པ་ནི་སྲིད་པའི་རྒྱུ་རྣམ་པ་བཞི་སྟེ། འདོད་པའི་ལེན་པ་དང་། ལྟ་བའི་ལེན་པ་དང་། ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་ཀྱི་ལེན་པ་དང་། བདག་ཏུ་སྨྲ་བའི་ལེན་པའོ། །
en: “Grasping, the cause of existence, is of four types: the grasping of desire, the grasping of view, the grasping of discipline and ascetic practice, and the grasping that promotes a self.

source: དེ་ལ་ལྟ་བ་ནི་རྣམ་པ་གཉིས་ཏེ། ལོག་པའི་ཤེས་པ་ཅན་དང་། དམིགས་པ་ཅན་ནོ། །
en: “There are two types of view: having mistaken knowledge and being involved in conceptual fixation.

source: དེ་ལ་ལོག་པའི་ཤེས་པ་ཅན་ནི་ལོག་པར་ལྟ་བའོ། །
en: Having mistaken knowledge refers to a mistaken view.

source: དམིགས་པ་ཅན་ནི་ཐ་ན་མྱ་ངན་ལས་འདས་པ་ལ་ཡང་དམིགས་ཤིང་མངོན་པར་དགའ་བ་སྟེ།
en: Being involved in conceptual fixation includes everything up to apprehending and delighting in nirvāṇa.

source: འདི་ནི་དམིགས་པ་ཅན་སངས་རྒྱས་རྣམས་ཀྱིས་སྨད་པའོ། །
en: Involvement in conceptual fixation is condemned by the buddhas.

source: དེ་ལ་ཐེ་ཚོམ་ནི་རྣམ་པ་གཉིས་ཏེ། ཐེག་པའི་བར་དུ་གཅོད་པ་དང་།
en: “There are two types of doubt: doubt that impedes the vehicle and doubt that impedes certainty.

source: ངེས་པར་གྱུར་པའི་བར་དུ་གཅོད་པའོ། །དེ་ལ་ཐེག་པའི་བར་དུ་གཅོད་པའི་ཐེ་ཚོམ་ནི་ཐེ་ཚོམ་གང་གིས་མྱུར་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ལ་ཐེ་ཚོམ་ཟ་བ་སྟེ།
en: Doubt that impedes the vehicle are doubts that consume one about how quickly one will become fully awakened.

source: ཧ་ཅང་ཡང་ཡུན་རིང་པོར་བསྡད་པ་འདིས་ཅི་ཞིག་བྱས།
en: Thinking, ‘What is the point in staying for so long?

source: ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པར་མྱུར་བ་མྱུར་བར་སྡུག་བསྔལ་མཐར་དབྱུང་ངོ་སྙམ་ནས་ཐེག་པ་ཆེན་པོ་སྤོང་བ་འདི་ནི་ཐེག་པའི་བར་དུ་གཅོད་པའི་ཐེ་ཚོམ་མོ། །
en: In the śrāvaka and pratyekabuddha vehicles suffering is quickly transcended’ one abandons the Great Vehicle. This is the kind of doubt that impedes the vehicle.

source: དེ་ལ་ངེས་པར་གྱུར་པའི་བར་དུ་གཅོད་པའི་ཐེ་ཚོམ་གང་ཞེ་ན།
en: What doubt impedes certainty?

source: ཐེ་ཚོམ་གང་གིས་ངེས་པར་གྱུར་པ་ལ་མི་འཇུག་པ་སྟེ།
en: Doubt due to which one does not gain certainty.

source: ངེས་པའི་ས་ཁོང་དུ་ཆུད་པར་མི་འགྱུར་བ་འདི་ནི་ངེས་པར་གྱུར་པའི་བར་དུ་གཅོད་པའི་ཐེ་ཚོམ་སྟེ།
en: Not understanding the state of certainty is the kind of doubt that impedes certainty.

source: འདི་ནི་ཐེ་ཚོམ་རྣམ་པ་གཉིས་སོ། །
en: These are the two types of doubt.

source: དེ་ལ་མཆོག་ཏུ་འཛིན་པ་ནི་སྦྱིན་པ་ལ་སོགས་པ་ལེགས་པར་སྤྱད་པ་རྣམས་ལ་འབྲས་བུ་ལ་སྨོན་པ་སྟེ།
en: “A sense of superiority refers to aspiring for the results of commendable acts of generosity and so forth.

source: བདག་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་ལ་སོགས་པ་འདི་དག་གིས་ལྷ་འམ་ལྷ་ལ་ལ་ཞིག་ཏུ་གྱུར་ཅིག་ཅེས་བྱ་བ་ལ་སོགས་པ་ཐམས་ཅད་ནི་ལོག་པར་སྨོན་པ་སྟེ།
en: One makes mistaken aspirations like, ‘Through these acts of generosity, discipline, and so forth may I become this or that god,’ and so on.

source: འདི་ནི་མཆོག་ཏུ་འཛིན་པ་ཞེས་བྱའོ། །
en: This is what is meant by a sense of superiority.

source: དེ་ལ་ང་རྒྱལ་ཞེས་བྱ་བ་ནི་སྙེམས་པས་ང་རྒྱལ་ཞེས་བྱ་སྟེ།
en: “Pride refers to pride born of arrogance.

source: འདི་ནི་ངན་ནོ། །བདག་ནི་བཙུན་ནོ། །བདག་ནི་དེ་དང་མཉམ་མོ་ཞེས་བྱ་བ་ལ་སོགས་པ་སྟེ།
en: One thinks, ‘This is bad,’ ‘I am noble,’ ‘I am equal to them,’ and so forth.

source: སྙེམས་པ་ནི་ང་རྒྱལ་ཞེས་བྱའོ། །
en: This type of arrogance is called pride.

source: དེ་ལ་རྒོད་པ་ནི་རྣམ་པ་གཉིས་ཏེ། ཉོན་མོངས་པ་སྐྱེད་པ་དང་ཤིན་ཏུ་སྙེམས་པའོ། །
en: “There are two kinds of agitation: agitation that produces the afflictive emotions, and agitation that produces intense arrogance.

source: དེ་ལ་ཉོན་མོངས་པ་སྐྱེད་པ་ནི་གཟུགས་ལ་གཙང་བར་ཡོངས་སུ་བརྟགས་ནས་ལུས་དང་ངག་དང་ཡིད་ཀྱིས་འགལ་བར་སྤྱོད་པ་སྟེ།
en: Agitation that produces the afflictive emotions refers to determining form to be pure, but then behaving incongruently in body, speech, and mind.

source: གང་འཕགས་པ་རྣམས་ཀྱིས་སྨད་པ་ཡིན་ནོ། །
en: Such behavior is condemned by the noble ones.

source: དེ་ལ་ཤིན་ཏུ་སྙེམས་པ་ནི་ངེས་པར་འབྱིན་པའི་ལམ་དེ་ཉིད་ལ་ཤིན་ཏུ་སྙེམས་པ་དང་། ཤིན་ཏུ་རྒྱུག་པ་དང་། བདག་ཉིད་སྙེམས་པ་སྟེ།
en: The agitation that produces intense arrogance is to be intensely arrogant about the path of emancipation itself, to be hasty, and to be self-conceited.

source: འདི་ནི་རྒོད་པ་ཞེས་བྱའོ། །
en: This is called agitation.

source: བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུ་པོ་དེ་དག་གིས་སྟོང་པ་ཉིད་ཀྱི་མི་འཐུན་པའི་ཕྱོགས་ཁོང་དུ་ཆུད་པར་བྱའོ།། །།བམ་པོ་གཉིས་པ།
en: “Bodhisattvas should understand the factors that oppose emptiness through these ten approaches to the way of the Dharma.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: “Child of good family, bodhisattvas should understand those who follow the teachings on emptiness through ten approaches to the way of the Dharma.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མི་འཕྲོགས་པ་དང་རྣམ་པར་མི་འགྲོ་བ་དང་། ཆགས་པ་མེད་ཅིང་ཆགས་པ་དང་བྲལ་བ་ཡང་མ་ཡིན་པ་དང་། འཇུག་པ་མེད་ཅིང་ལྡོག་པ་མེད་པ་དང་།
en: What are these ten?

source: འཐབ་པ་མེད་ཅིང་རྩོད་པ་མེད་པ་དང་བྲི་བ་མེད་ཅིང་གང་བ་མེད་པ་དང་། འདུ་བྱེད་ཐམས་ཅད་རང་བཞིན་གྱིས་འགགས་པར་བཟོད་པ་དང་། ཆོས་གང་ཡང་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་མ་བསྐྱེད། སངས་རྒྱས་རྣམས་ཀྱིས་མ་བཀག་གོ་ཞེས་ཐོས་ན་མི་སྐྲག་པ་དང་། འཁོར་བའི་རང་བཞིན་དང་མྱ་ངན་ལས་འདས་པའི་རང་བཞིན་དེ་དག་མཚུངས་སོ་ཞེས་ཐོས་ན་ཐེ་ཚོམ་མི་ཟ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་རྟག་པ།
en: (1) Not being swayed and not moving; (2) being neither attached nor free from attachment; (3) neither accepting nor rejecting; (4) neither fighting nor arguing; (5) neither diminishing nor increasing; (6) tolerating the natural cessation of all formations; (7) not being afraid when hearing, ‘Nothing is ever produced by ordinary people nor is brought to an end by the buddhas’; (8) not being consumed with doubt when hearing, ‘The nature of saṃsāra and the nature of nirvāṇa are the same’; and (9) acting upon hearing, ‘The body of the Thus-Gone One is permanent and (10) its qualities are inexhaustible.’
